tap "valkyrie00/bbrew"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Text processor and publishing toolchain for AsciiDoc
brew "asciidoctor"
# Code searching, linting, rewriting
brew "ast-grep"
# Improved shell history for zsh, bash, fish and nushell
brew "atuin"
# Preexec and precmd functions for Bash (like Zsh)
brew "bash-preexec"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Simple wrapper script for the Borg backup software
brew "borgmatic"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Translates human-readable Butane Configs into machine-readable Ignition Configs
brew "butane"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# General-purpose scripting language
brew "php"
# Dependency Manager for PHP
brew "composer"
# Load/unload environment variables based on $PWD
brew "direnv"
# Linux utility to get information on filesystems, like df but better
brew "dysk"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# GitHub command-line tool
brew "gh"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Blazing fast terminal-ui for git written in rust
brew "gitui"
# Render markdown on the CLI
brew "glow"
# Post-modern modal text editor
brew "helix"
# Easy plain text accounting with command-line, terminal and web UIs
brew "hledger"
# Lazier way to manage everything docker
brew "lazydocker"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# NCurses Disk Usage
brew "ncdu"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Fast, disk space efficient package manager
brew "pnpm"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Extremely fast Python linter, written in Rust
brew "ruff"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Cross-shell prompt for astronauts
brew "starship"
# Very fast implementation of tldr in Rust
brew "tealdeer"
# Powerful free data recovery utility
brew "testdisk"
# Services for Typst
brew "tinymist"
# Command-line interface to the freedesktop.org trashcan
brew "trash-cli"
# Markup-based typesetting system
brew "typst"
# Ultra fast grep with query UI, fuzzy search, archive search, and more
brew "ugrep"
# Cross-platform Rust rewrite of the GNU coreutils
brew "uutils-coreutils", link: false
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Pluggable terminal workspace, with terminal multiplexer as the base feature
brew "zellij"
# Programming language designed for robustness, optimality, and clarity
brew "zig"
# Language Server for Zig
brew "zls"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# Modern TUI for managing Homebrew packages and casks on macOS and Linux
brew "valkyrie00/bbrew/bbrew"
cask "font-0xproto-nerd-font"
cask "font-blex-mono-nerd-font"
cask "font-caskaydia-mono-nerd-font"
cask "font-comic-shanns-mono-nerd-font"
cask "font-droid-sans-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-go-mono-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-sauce-code-pro-nerd-font"
cask "font-source-code-pro"
cask "font-ubuntu-nerd-font"
vscode "amiralizadeh9480.laravel-extra-intellisense"
vscode "astro-build.astro-vscode"
vscode "bmewburn.vscode-intelephense-client"
vscode "catppuccin.catppuccin-vsc"
vscode "codingyu.laravel-goto-view"
vscode "damms005.devdb"
vscode "dreamcatcher45.podmanager"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "glitchbl.laravel-create-view"
vscode "ihunte.laravel-blade-wrapper"
vscode "laravel.vscode-laravel"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "mtxr.sqltools"
vscode "myriad-dreamin.tinymist"
vscode "naoray.laravel-goto-components"
vscode "onecentlin.laravel-blade"
vscode "onecentlin.laravel-extension-pack"
vscode "onecentlin.laravel5-snippets"
vscode "pgl.laravel-jump-controller"
vscode "pkief.material-icon-theme"
vscode "qwtel.sqlite-viewer"
vscode "redhat.vscode-yaml"
vscode "ryannaddy.laravel-artisan"
vscode "shufo.vscode-blade-formatter"
vscode "tomoki1207.pdf"
vscode "vscode-icons-team.vscode-icons"
vscode "yzhang.markdown-all-in-one"
cargo "typst-cli"
flatpak "app.drey.Warp"
flatpak "app.katvan.Katvan"
flatpak "app.zen_browser.zen"
flatpak "be.alexandervanhee.gradia"
flatpak "ca.desrt.dconf-editor"
flatpak "cafe.avery.Delfin"
flatpak "com.actualbudget.actual"
flatpak "com.belmoussaoui.Decoder"
flatpak "com.bitwarden.desktop"
flatpak "com.calibre_ebook.calibre"
flatpak "com.github.PintaProject.Pinta"
flatpak "com.github.dynobo.normcap"
flatpak "com.github.hugolabe.Wike"
flatpak "com.github.huluti.Coulr"
flatpak "com.github.johnfactotum.Foliate"
flatpak "com.github.johnfactotum.QuickLookup"
flatpak "com.github.marhkb.Pods"
flatpak "com.github.tchx84.Flatseal"
flatpak "com.github.tenderowl.frog"
flatpak "com.github.wwmm.easyeffects"
flatpak "com.github.zocker_160.SyncThingy"
flatpak "com.google.Chrome"
flatpak "com.heroicgameslauncher.hgl"
flatpak "com.jeffser.Alpaca"
flatpak "com.jeffser.Pigment"
flatpak "com.mattjakeman.ExtensionManager"
flatpak "com.rafaelmardojai.Blanket"
flatpak "com.ranfdev.DistroShelf"
flatpak "com.ranfdev.Geopard"
flatpak "com.sidevesh.Luminance"
flatpak "com.valvesoftware.Steam"
flatpak "de.leopoldluley.Clapgrep"
flatpak "dev.bragefuglseth.Keypunch"
flatpak "dev.geopjr.Archives"
flatpak "dev.geopjr.Calligraphy"
flatpak "dev.geopjr.Collision"
flatpak "dev.mufeed.Wordbook"
flatpak "dev.qwery.AddWater"
flatpak "dev.vencord.Vesktop"
flatpak "dev.zed.Zed"
flatpak "fr.handbrake.ghb"
flatpak "info.febvre.Komikku"
flatpak "io.anytype.anytype"
flatpak "io.bassi.Amberol"
flatpak "io.dbeaver.DBeaverCommunity"
flatpak "io.github.Foldex.AdwSteamGtk"
flatpak "io.github.alainm23.planify"
flatpak "io.github.alyraffauf.Switchyard"
flatpak "io.github.amit9838.mousam"
flatpak "io.github.celluloid_player.Celluloid"
flatpak "io.github.diegoivan.pdf_metadata_editor"
flatpak "io.github.flattool.Ignition"
flatpak "io.github.flattool.Warehouse"
flatpak "io.github.getnf.embellish"
flatpak "io.github.giantpinkrobots.flatsweep"
flatpak "io.github.giantpinkrobots.varia"
flatpak "io.github.idevecore.Valuta"
flatpak "io.github.ilya_zlobintsev.LACT"
flatpak "io.github.johnfactotum.Runemaster"
flatpak "io.github.josephmawa.Gauge"
flatpak "io.github.kolunmi.Bazaar"
flatpak "io.github.lo2dev.Echo"
flatpak "io.github.mfat.sshpilot"
flatpak "io.github.nozwock.Packet"
flatpak "io.github.plrigaux.sysd-manager"
flatpak "io.github.ronniedroid.concessio"
flatpak "io.github.sitraorg.sitra"
flatpak "io.github.tobagin.digger"
flatpak "io.gitlab.adhami3310.Converter"
flatpak "io.gitlab.adhami3310.Impression"
flatpak "io.gitlab.librewolf-community"
flatpak "io.gitlab.liferooter.TextPieces"
flatpak "io.gitlab.news_flash.NewsFlash"
flatpak "io.missioncenter.MissionCenter"
flatpak "io.podman_desktop.PodmanDesktop"
flatpak "it.mijorus.gearlever"
flatpak "it.mijorus.smile"
flatpak "me.iepure.devtoolbox"
flatpak "net.codelogistics.letters"
flatpak "net.nokyan.Resources"
flatpak "org.blender.Blender"
flatpak "org.gaphor.Gaphor"
flatpak "org.gimp.GIMP"
flatpak "org.gnome.Builder"
flatpak "org.gnome.Calculator"
flatpak "org.gnome.Calendar"
flatpak "org.gnome.Characters"
flatpak "org.gnome.Connections"
flatpak "org.gnome.Contacts"
flatpak "org.gnome.DejaDup"
flatpak "org.gnome.FileRoller"
flatpak "org.gnome.Firmware"
flatpak "org.gnome.Logs"
flatpak "org.gnome.Loupe"
flatpak "org.gnome.Maps"
flatpak "org.gnome.NautilusPreviewer"
flatpak "org.gnome.Papers"
flatpak "org.gnome.Showtime"
flatpak "org.gnome.SimpleScan"
flatpak "org.gnome.Snapshot"
flatpak "org.gnome.SoundRecorder"
flatpak "org.gnome.TextEditor"
flatpak "org.gnome.Weather"
flatpak "org.gnome.World.PikaBackup"
flatpak "org.gnome.baobab"
flatpak "org.gnome.clocks"
flatpak "org.gnome.design.IconLibrary"
flatpak "org.gnome.font-viewer"
flatpak "org.gustavoperedo.FontDownloader"
flatpak "org.inkscape.Inkscape"
flatpak "org.kde.krita"
flatpak "org.kde.okular"
flatpak "org.libreoffice.LibreOffice"
flatpak "org.localsend.localsend_app"
flatpak "org.mozilla.Thunderbird"
flatpak "org.mozilla.firefox"
flatpak "org.nickvision.tubeconverter"
flatpak "org.onlyoffice.desktopeditors"
flatpak "org.raspberrypi.rpi-imager"
flatpak "org.telegram.desktop"
flatpak "org.videolan.VLC"
flatpak "org.zotero.Zotero"
flatpak "page.kramo.Cartridges"
flatpak "page.tesk.Refine"
flatpak "studio.planetpeanut.Bobby"
flatpak "to.bnt.sendworm"
